//=======================================================//
//
// ライト処理 [light.h]
// Author : Shun Yokomichi
//
//=======================================================//
#ifndef _LIGHT_H_
#define _LIGHT_H_

//*******************************************************//
// ヘッダファイルのインクルード
//*******************************************************//
#include "main.h"	// メイン

//*******************************************************//
// マクロ定義
//*******************************************************//
#define MAX_LIGHT	(2)	// ライト最大数

//*******************************************************//
// クラス定義
//*******************************************************//
class CLight
{// CLight
public:
	CLight() {};	// コンストラクタ(中身無し)
	~CLight() {};	// デストラクタ(中身無し)

	HRESULT Init(void);		// 初期化処理
	void Uninit(void) {};	// 終了処理(中身無し)
	void Update(void) {};	// 更新処理(中身無し)

	D3DLIGHT9 GetLightVec(void) { return m_Light[0]; }

private:
	D3DLIGHT9 m_Light[MAX_LIGHT];							// ライト
	D3DXCOLOR m_color = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0);	// カラー
};
#endif