//*****************************************************************************
//
//		テクスチャの処理[texture.h]
//		Auther : shun yokomichi
//
//*****************************************************************************
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2D.h"	// 2Dポリゴン

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
//		マクロ定義
//*****************************************************************************

//*****************************************************************************
//		クラス定義(ポリゴン)
//*****************************************************************************
class CTexture
{
public:
	typedef enum
	{
		//================
		// ツール内
		//================
		TYPE_SELECT_ICON = 0,	// 選択アイコン
		TYPE_SAVE_LOGO,			// セーブ時ロゴ
		TYPE_MAX
	}TEXTYPE;
	CTexture();
	~CTexture();

	static HRESULT Load(void);	//	読み込む関数(テクスチャ)
	static void Unload(void);	// 開放する関数(テクスチャ)
	static LPDIRECT3DTEXTURE9 *GetTexture(int nIdx) { return &m_apTexture[nIdx]; }

private:
	// 静的メンバ変数
	static LPDIRECT3DTEXTURE9 *m_apTexture;
	static const char *m_apFilename[];
};

#endif

